# Referenties

Altijd beginnen met 'getting started':

https://pandas.pydata.org/docs/getting_started/index.html#getting-started

Dan een snel overzicht:

https://pandas.pydata.org/docs/user_guide/10min.html

Daarna kijken naar de API beschrijving:

https://pandas.pydata.org/docs/reference/index.html

# Installatie

Run `pip3 install pandas` in the terminal to install the Pandas library.

# Imports

In [1]:
import pandas as pd

import matplotlib.pyplot as plt

# Schetsen

In [64]:
# Dataframe maken
df = pd.DataFrame(
    {
        "Name": [
            "Braund, Mr. Owen Harris",
            "Allen, Mr. William Henry",
            "Bonnell, Miss. Elizabeth",
        ],
        "Age": [
            22,
            35,
            58
        ],
        "Sex": [
            "male",
            "male",
            "female"
        ],
    }
)

# Standaard print
print(df)

# Vergelijk met
# display(df)

# Lijkt op, maar anders dan
# df
# print(1)

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

In [5]:
# Data opslaan
df.to_csv("demo.csv")

In [83]:
# Data inlezen
df2 = pd.read_csv("demo.csv", index_col = 0)
print(df2)

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

In [53]:
# De kolomnaam
print(df2.columns)

Index(['Name', 'Age', 'Sex'], dtype='object')

In [59]:
# Een kolom lezen
display(df2['Name'])
display(df2[df2.columns[1]])
display(df2.Name)

0     Braund, Mr. Owen Harris
1    Allen, Mr. William Henry
2    Bonnell, Miss. Elizabeth
3                David Jansen
Name: Name, dtype: object

0    22
1    35
2    58
3    30
Name: Age, dtype: int64

0     Braund, Mr. Owen Harris
1    Allen, Mr. William Henry
2    Bonnell, Miss. Elizabeth
3                David Jansen
Name: Name, dtype: object

In [65]:
# Een kolom verwijderen
# df2 = df2.drop('Sex', axis=1)
df2.pop('Sex')
print(df2)

                       Name  Age
0   Braund, Mr. Owen Harris   22
1  Allen, Mr. William Henry   35
2  Bonnell, Miss. Elizabeth   58

In [72]:
# Een rij lezen
print(df2.iloc[0])

Name    Braund, Mr. Owen Harris
Age                          22
Name: 0, dtype: object
Empty DataFrame
Columns: [Name, Age]
Index: []

In [32]:
# Functie getRow() maken
def get_row(df, index):
    return df.iloc[index]

print(getRow(df2, 1))

Name    Allen, Mr. William Henry
Age                           35
Sex                         male
Name: 1, dtype: object

In [84]:
# Een rij toevoegen
df2.loc[len(df2.index)]= {"Name": "David Jansen", "Age": 30, "Sex": "male"}
# En weer verwijderen
df2 = df2.drop(len(df2.index)-1)
display(df2)

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

In [133]:
# Functie insertAt(row, index)
# ...

In [134]:
# Verkennen
# ...

In [97]:
# Filteren
display(df2.query("Age > 30 and Sex == 'male'"))
display(df2[df2['Age'] > 30])
display(df2[df2['Name'].str.find('Eliz') != -1])
display(df2[df2['Name'].str.contains('B')])

                       Name  Age   Sex
1  Allen, Mr. William Henry   35  male

                       Name  Age     Sex
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female

                       Name  Age     Sex
2  Bonnell, Miss. Elizabeth   58  female

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
2  Bonnell, Miss. Elizabeth   58  female

In [136]:
# Groeperen
# ...

In [69]:
# Extra: toepassing OOP en het bouwen van je eigen library

6
[1, 2]